# Cursor Extensions
# Generated on Wed Feb 19 19:29:16 GMT 2025

alefragnani.project-manager
antiantisepticeye.vscode-color-picker
arahata.linter-actionlint
bibhasdn.unique-lines
bodil.file-browser
carlos-algms.make-task-provider
connorshea.vscode-ruby-test-adapter
ctf0.macros
dnut.rewrap-revived
efbenson.scad
fnando.linter
foxundermoon.shell-format
github.remotehub
github.vscode-github-actions
github.vscode-pull-request-github
gofenix.go-lines
golang.go
gruntfuggly.todo-tree
hbenl.vscode-test-explorer
kahole.magit
karunamurti.haml
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-vscode-remote.remote-containers
ms-vscode.remote-repositories
ms-vscode.test-adapter-converter
redhat.vscode-yaml
rrudi.vscode-dired
rust-lang.rust-analyzer
shan.code-settings-sync
shopify.ruby-extensions-pack
shopify.ruby-lsp
sorbet.sorbet-vscode-extension
sumneko.lua
swellaby.vscode-rust-test-adapter
tamasfe.even-better-toml
tuttieee.emacs-mcx
viktorzetterstrom.non-breaking-space-highlighter
wenhoujx.swiper
zhuangtongfa.material-theme
